<?php

namespace Database\Seeders;

use App\Models\Rubric;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class RubricSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $rubrics = [
            [
                'name' => 'Авиа/ЖД Кассы',
                'icon' => '',
            ],
            [
                'name' => 'Авто-Мото',
                'icon' => '',
            ],
            [
                'name' => 'Аптеки',
                'icon' => '',
            ],
            [
                'name' => 'Безопасность и охрана',
                'icon' => '',
            ],
            [
                'name' => 'Бытовая техника',
                'icon' => '',
            ],
            [
                'name' => 'Бытовая химия - Упаковочные материалы',
                'icon' => '',
            ],
            [
                'name' => 'Ветеринарные клиники - ЗОО товары',
                'icon' => '',
            ],
            [
                'name' => 'Все для красоты',
                'icon' => '',
            ],
            [
                'name' => 'Гостиницы-Отели',
                'icon' => '',
            ],
            [
                'name' => 'Готовая кухня',
                'icon' => '',
            ],
            [
                'name' => 'Грузовые перевозки',
                'icon' => '',
            ],
            [
                'name' => 'Детские товары и одежда',
                'icon' => '',
            ],
            [
                'name' => 'Дизайн и декор',
                'icon' => '',
            ],
            [
                'name' => 'Досуг и развлечение',
                'icon' => '',
            ],
            [
                'name' => 'Заправка картриджей',
                'icon' => '',
            ],
            [
                'name' => 'Здоровье',
                'icon' => '',
            ],
            [
                'name' => 'Инструменты',
                'icon' => '',
            ],
            [
                'name' => 'Кадастровые работы',
                'icon' => '',
            ],
            [
                'name' => 'Канцтовары',
                'icon' => '',
            ],
            [
                'name' => 'Кожгалантерея',
                'icon' => '',
            ],
            [
                'name' => 'Компьютеры - Оргтехника',
                'icon' => '',
            ],
            [
                'name' => 'Кондитерские изделия',
                'icon' => '',
            ],
            [
                'name' => 'Кондиционеры и вентиляция',
                'icon' => '',
            ],
            [
                'name' => 'Мебель и интерьер',
                'icon' => '',
            ],
            [
                'name' => 'Мужская и женская одежда',
                'icon' => '',
            ],
            [
                'name' => 'Музыкальные инструменты',
                'icon' => '',
            ],
            [
                'name' => 'Недвижимость - Строительство',
                'icon' => '',
            ],
            [
                'name' => 'Обучение - Образование',
                'icon' => '',
            ],
            [
                'name' => 'Окна и двери',
                'icon' => '',
            ],
            [
                'name' => 'Оптика',
                'icon' => '',
            ],
            [
                'name' => 'Организация праздников',
                'icon' => '',
            ],
            [
                'name' => 'Пассажирские перевозки',
                'icon' => '',
            ],
            [
                'name' => 'Пивные магазины',
                'icon' => '',
            ],
            [
                'name' => 'Подарки, сувениры',
                'icon' => '',
            ],
            [
                'name' => 'Продуктовые магазины',
                'icon' => '',
            ],
            [
                'name' => 'Рекламные агентства',
                'icon' => '',
            ],
            [
                'name' => 'Рестораны - Кафе',
                'icon' => '',
            ],
            [
                'name' => 'Санатории',
                'icon' => '',
            ],
            [
                'name' => 'Сантехника и отопление',
                'icon' => '',
            ],
            [
                'name' => 'Сельское хозяйство',
                'icon' => '',
            ],
            [
                'name' => 'Сотовые телефоны - Продажа, ремонт',
                'icon' => '',
            ],
            [
                'name' => 'Спецодежда',
                'icon' => '',
            ],
            [
                'name' => 'Спецтехника',
                'icon' => '',
            ],
            [
                'name' => 'Спорт - Товары для спорта',
                'icon' => '',
            ],
            [
                'name' => 'Стоматологии',
                'icon' => '',
            ],
            [
                'name' => 'Строительно-отделочные материалы',
                'icon' => '',
            ],
            [
                'name' => 'Такси',
                'icon' => '',
            ],
            [
                'name' => 'Товары для дома',
                'icon' => '',
            ],
            [
                'name' => 'Торговое оборудование',
                'icon' => '',
            ],
            [
                'name' => 'Туристические компании',
                'icon' => '',
            ],
            [
                'name' => 'Услуги',
                'icon' => '',
            ],
            [
                'name' => 'Фото-видео студии',
                'icon' => '',
            ],
            [
                'name' => 'Хозтовары',
                'icon' => '',
            ],
            [
                'name' => 'Цветы, растения',
                'icon' => '',
            ],
            [
                'name' => 'Чай - кофе',
                'icon' => '',
            ],
            [
                'name' => 'ЭКО товары',
                'icon' => '',
            ],
            [
                'name' => 'ЭкспертизаЭлектротовары',
                'icon' => '',
            ],
            [
                'name' => 'Ювелирные изделия',
                'icon' => '',
            ],
            [
                'name' => 'Юридические услуги, сопровождение',
                'icon' => '',
            ]
        ];

        foreach ($rubrics as $rubric) {
            Rubric::query()->create($rubric);
        }
    }
}
